{
    "projects": {
        "cards": [
            {
                "title": "Minecraft Server Installer",
                "text": "Minecraft Server Installer est un petit script codé en Lua qui permet de créer des serveurs facilement sous Linux. Le script vous demande de rentrer le nom pour le dossier du serveur minecraft et sa version. Puis il téléchargera et exécutera l'installateur tout seul en acceptant l'EULA et en installant Screen et Java pour lancer le serveur minecraft. Après ça, il crée un script de lancement shell propre au serveur.",
                "link": "https://github.com/tralalax/MCserver-installer",
                "delay": 0
            },
            {
                "title": "Ce Site Web",
                "text": "Mon site portfolio (ce site-là) réaliser sans template en ReactJS",
                "link": "https://github.com/tralalax/timeo-website",
                "delay": 60
            },
            {
                "title": "Youtube Playlist Downloader",
                "text": "Il s'agit d'un programme écrit en Rust permettent de télécharger automatiquement les vidéos de playlists YouTube. Le programme enregistre les IDs des vidéos dans une base de données SQLite pour comparer les vidéos déjà téléchargées des nouvelles qui sont à télécharger. Ce programme m'est utile pour faire des sauvegardes de mes playlists YouTube ainsi que pour écouter de la musique hors connexion.",
                "link": "https://github.com/tralalax/YTB-playlist-downloader",
                "delay": 120
            },
            {
                "title": "Bot Discord",
                "text": "Création de bot discord en Python avec leur API Discord.py. Je peux utiliser des bases de données SQL ou des API spécifique si besoin. La plupart de mes projets ont été faits sur mesure pour des \"clients\", le code n'est donc pas public. Si vous êtes intéressé contacté moi sur discord.",
                "link": "https://github.com/tralalax",
                "delay": 180
            }
        ]
    }
}